-- Лабораторна робота №2
-- Студента групи КН-31 Однодворця Іллі. Варіант 8

-- Завдання 1. Визначити довжину послiдовностi тотожних елементiв списку,
-- напр.: "aaabbcaadddd"⇒ [(’a’,3), (’b’,2), (’c’,1), (’a’,2), (’d’,4)]
import Data.Map (toList, fromListWith)
funk y = toList (fromListWith (+) [(x, 1) | x <- y]) 

-- Завдання 2. Знайти найбільший спільний дільник двох чисел 
findGcd x y = gcd x y 

-- Висновок: отже, я набув досвіду визначення рекурсивних функцій, 
-- використання механізму зіставлення зі зразком i роботи з кортежами та списками.